[NAN]
53
55
14854817
54
15252363
42
14720387
98
41
14853024
14976902
104
102
110
62
115
52
14856354
105
14783159
15706534
117
49
14723726
13
14717871
14852753
51
14718849
14925705
14725004
116
84
14781097
14723472
14717848
14785469
14851258
14721174
50
68
14854553
14976901
15632285
14790566
14847873
87
48
15697082
14720169
107
14925725
15252381
15705739
15708828
14923942
63
14781831
100
14924443
14849419
74
14846102
119
15640254
15630486
14859955
14925738
15706553
15710364
14925703
83
14791826
14785451
70
14854334
14847407
14728344
114
14925245
14846865
14726332
15706282
14715319
14850237
14785423
14722963
14717874
14782359
99
126
75
14728608
14785448
44
88
40
14925193
14859143
14788518
111
96
14847398
14850444
14924703
14780072
14726844
14791308
14925479
85
14727830
14859453
14859953
14924977
106
14925185
15709092
15631535
14846093
14782848
14782910
14849935
14724785
14850991
78
14780567
14851759
14853292
15252367
14859681
15252380
14847388
14854807
14924472
14723494
14784919
14847921
14925195
67
101
15709080
14844591
14925710
15638181
15641759
39
14782903
14925757
66
14722706
14784899
14851257
14780320
14925709
14782384
113
15699126
14728340
14844587
14849158
14786217
69
15710336
97
14925756
15696045
14853021
72
14728347
14924962
73
14844290
14728632
14847900
14782641
14785422
14925741
15252366
14728323
14724264
14788480
15710084
14728081
14844596
43
14859667
14859144
14925216
108
14721159
15637633
14791302
15710888
81
14924436
15630472
14854557
127
14719878
14854542
64
14849929
15704454
14851237
14924701
14846864
14847384
14846600
14846085
14854539
14846608
14724249
15704193
15706241
15704228
14846909
14925219
14849931
14859668
14844093
14846135
86
77
15639967
15638146
14844318
14784945
46
14854577
14780832
14720191
15706258
14728328
14859956
14785418
14786237
15634601
15710359
14847626
14714302
14925227
14852995
15637157
15042459
14787719
15042458
14847918
14791612
14851005
14846120
14724011
14854815
14848641
65
14849695
14780834
14924711
15641995
15634611
14845064
14925708
14716606
14846143
14860165
14792325
14844578
14860175
14859656
15704760
15708039
14850999
14723729
82
79
15638424
15705775
14847916
14847927
15706557
14788225
34
14847893
112
15696052
14780294
14857869
14846601
14847406
14924988
14858372
14784923
14790838
14846097
14846610
15701922
14846360
14715264
14781858
15630464
15639939
14716590
14850704
15630474
14924964
15697555
14854590
15638167
14791344
14783119
14925716
15637383
15706538
14924941
14847399
15710881
14719138
14925723
14785432
15706246
14849942
14780847
14728324
14722950
15708803
14846128
14924426
15635128
14794135
14846850
14857874
14788239
14925706
15708328
14858120
14783155
15639958
14844340
14860223
14852794
14783409
14721977
14858384
14728371
14925196
14925205
80
14783626
14785192
15710649
14786216
15706243
15698352
15630986
14853009
14854800
14854565
14858630
14783400
14724236
15704195
14844592
14785415
14853002
14779288
14858113
14788755
14784674
14860164
14858640
15710391
14854331
14844593
14858665
14726053
14782626
14781318
14722695
14846592
14779522
14847385
15706300
14791855
15706537
14721162
14722729
14715304
14924188
14780552
14726585
15710612
14849677
14853529
76
15632270
14849923
14846598
14719896
14853038
15697794
15702410
14859154
14781312
14844033
14846116
14724797
14923930
15634607
50608
14728320
15636660
15635335
15635855
14857861
14788543
14847888
14850200
15699333
14780821
14784426
14785186
14779272
14844558
15699885
14924937
14858898
14792088
14720150
15632280
14859960
14782367
15632020
14727849
14788023
14783134
14783422
14782092
14717602
47
14925473
15706274
14782631
15706297
14851225
14844598
14781611
14789282
14788542
14859957
14721981
14853508
15640242
15697547
14851228
14859197
14856345
14716544
14925206
14786472
14789542
14852992
15709103
14859141
14792344
14788539
14783927
14721689
14791305
15710891
14781592
14792334
14782087
14717579
14727561
14791055
15710361
14849930
14782878
14785715
95
109
14780314
15710614
118
15704206
15698820
14789281
14846111
14780348
14781842
14847414
14721192
14721212
14858917
14781334
14783914
14846348
14728084
14723463
14924727
14857910
14727587
15706531
14858934
14924678
14716337
14845883
14788528
15705218
15706277
15706552
15706288
15708546
14845359
14844338
15704197
15639937
15710906
15635641
14924984
14788260
14925454
14924940
15697796
14716075
14846090
14784411
14854564
14721468
14924425
14724254
14781859
15708312
14720700
14924172
14794687
15638402
15632295
15709093
15632261
14785156
14925452
14728335
14846908
14783417
14855573
15706551
14786452
14925731
14788754
14785208
15706262
14858682
14781596
14854563
14792627
14784902
14976919
14854566
14976918
14781093
14791845
15706266
14924986
15637141
15639689
14858412
14786441
14850688
14846337
14924976
14789042
14853303
14727861
14715050
14858131
14925463
14789284
14852485
14783416
15709862
15699624
15710596
14794626
15635369
61
14849162
14788744
14782358
14782890
14728321
15697333
14784912
14728609
14781840
15632262
14716555
14716559
14849711
14792595
14844548
14844559
14782112
14846621
14717878
15632316
14859649
15635633
14792359
14856373
14850185
14976909
14847669
14785175
14856361
14857863
15708338
15638154
14714026
14924446
14924963
14851239
14851242
15631785
14846091
15637145
14923945
14728362
15706291
14846640
14849167
14794385
14844299
14780831
15637915
14779320
15704198
14785190
14781329
14854273
15709118
14786489
14713240
14860193
14976908
15706250
15712173
14780837
15706536
15697314
15699080
15699645
14924688
14844040
15704213
14786949
15709098
14848937
14856346
14849963
14726055
14713777
14718852
14849722
14848387
14720179
14728379
15696051
14858134
14844090
60
14858901
14723769
15699637
15639705
15635334
14715817
15706533
15697035
15710134
15698583
14723200
14925203
15634620
90
14856843
15710594
14925713
14845597
14788502
14720697
14791326
125
14728350
14850238
94
14792116
14858115
14789283
14788495
14852243
14782344
14844315
14847898
14782100
14722731
14792598
14853043
14859666
14792320
14924973
15710593
92
14925715
15697803
14925696
14853046
14925213
14792378
14786456
14781882
15697318
14723731
14924959
15697565
14728125
15638190
14858900
15701146
15637896
14846910
15638927
14858627
15697567
15710378
14725048
15638453
15710908
14846630
14784131
14844092
15642294
15703709
15637680
14793903
15638449
14719652
14844573
14728613
14788258
14844316
14785157
14847907
14717884
14847902
14924945
14847416
14720159
15701946
14727356
15710654
14853016
14793619
15708340
14728330
15710358
15697798
15708335
14719146
15630475
15638929
15637945
14789561
15706549
14725044
15640241
14791586
14925700
15708596
14728351
15696797
14779572
14723774
15042451
15709089
14793891
14792839
14720141
14719884
14782136
14851757
14859664
15642289
14852752
14849934
14782888
15638179
14925228
14785453
15706280
14781614
15710095
14781570
14849964
15638450
15642297
15696831
14858118
14844588
14723734
15704207
14721207
15705766
15710895
14781582
14846096
14850996
14924971
15710398
14783625
14860201
14794664
14723740
14793894
14782126
14726056
14782906
14847935
14783106
14717058
14728366
14728110
14858129
14844546
15710889
15635611
15710363
14779790
15705516
14713504
15631546
14844586
14857881
14846114
14924186
14724263
14852236
14717876
15696569
14721173
33
15710342
14859696
14846396
15711660
14925753
14785424
14847656
93
15708825
14782090
14782353
14850436
14851001
14782137
14779040
14781326
15706253
15706785
14847661
14716843
14847911
14794663
14924731
15638942
14792124
14851251
14726836
15698596
14845602
14721416
14852280
14780582
14722182
14791304
14781080
15638456
14719150
14847872
14853037
15710366
15638192
15705762
14781588
15696790
14854296
14788020
14785176
15637634
14925466
14791568
14854559
14858672
14783140
14857616
15637911
15709088
15632264
15635358
14924948
15699368
14785159
15632056
15044744
14721711
14717598
14924216
14790844
14781578
14791577
15708848
14782142
14846609
14846094
14846092
14924468
14844607
14791054
14790832
14925442
15708314
15631510
14849455
14717328
14846605
14791564
14847139
15704225
14724792
14846133
14858626
14784660
14721158
14794670
14724001
14719156
14784663
14780565
15632034
15637681
14792126
14785194
15637150
14844554
14728628
14783420
14860192
15701648
14780811
15640253
15698600
14719160
14925212
15710639
14720145
14782594
14850968
15638162
14782392
14846341
14791836
15639962
14859441
14847412
14858166
14782135
15639447
14856371
14846123
14793608
14783112
14924434
14858173
14714540
15697815
14849960
14854534
15642283
14845576
14846369
14923908
14850695
14716854
14844594
14728095
14844327
15644038
14858636
15697808
14726549
15710638
15709119
14854820
14844298
14846647
15706273
14844556
15642031
14844341
14853785
15710394
15632277
14782625
14786471
14844599
14849953
14846636
14845848
14857864
14859175
15637159
14782639
14789259
14860177
15710367
14844604
14844595
15706543
15697825
14785717
14717356
15638452
14785942
15634602
14859680
15699105
14781841
14854332
15638460
15697549
14856070
14858418
14780815
14849924
14924192
15645846
14728621
14859675
14925464
14850716
14925495
14787733
15712136
15708557
15707534
15708556
14782111
37
14724486
15645086
14846644
14720698
14858631
15699902
15704449
14845854
14925730
15696005
15703702
14844071
15698075
15708292
14786466
14851261
14793371
14781352
15703724
14782124
14925198
15631751
14785455
14846612
14726542
14785720
14793878
14728638
14788008
14787466
14723987
15630477
14782381
15709094
15645335
14786205
36
14794677
14785967
45
15636654
14860171
15697051
14854554
14854283
15708855
14781569
14925749
15635099
14924717
15638913
15706269
14859198
15635590
14786443
14719931
14925722
14781844
14717877
14925478
14793907
14847885
14779560
14845568
15639704
14856374
15710355
14787753
14854586
14859190
14714546
14858669
14844603
14791605
14722442
14715310
14725001
14849983
14846631
14857858
14854021
14850711
14779559
14847648
14717084
14845595
14846129
14781837
14728352
15638145
15708817
15634099
14781627
14781074
14785174
14856358
14924705
14925747
15700104
14925751
14854536
14857628
14860202
14724496
15709082
14791609
14792094
14792120
14847932
14857399
15630997
14925225
15710650
14844856
14789285
15696782
121
15699382
14726285
14779812
15637907
15637677
15632263
14924417
15640249
14723510
14850726
14790815
15708580
14845834
14782604
14781602
14858170
14853033
14722995
14786971
14859922
14717320
14853551
14719623
14859906
14853804
15701439
14724999
14793140
14714299
14847128
14924930
14852736
14854017
14781104
15638920
15631777
15710345
14789308
14858171
57
15710899
14846132
14726794
14846125
14716574
15635645
14786231
14790573
14792078
14728376
15710127
14723241
14856353
14794152
14852748
14851255
14847920
14846596
14781317
15632016
14714536
15709104
14720149
14781601
14852770
14781587
14785723
15706542
14858639
14791863
14714553
14846115
15705735
14781346
14857134
14925471
14844074
14713761
15709107
14791329
14782864
14853779
14783894
14784159
14858138
123
14845885
14782102
14721176
14785690
15706254
15698574
14780322
14858926
14713741
15630741
14850959
14780069
14853000
14724258
14721979
14846338
14717334
14844336
15046310
14785209
15699865
15699841
15701406
14722484
14923907
15046311
15710360
14859151
14852788
14854555
14782600
14717313
15632257
14782608
14789536
14785436
15635877
14788488
15640248
14849679
15639209
14791093
14789004
15705222
14788780
14850945
14846392
15708812
14859661
14717369
14847879
14728838
14781846
15631804
14781855
15635864
14854584
14788764
14728365
14856118
15710128
14780078
14716572
15638147
14854580
15697320
15632279
14788235
14850437
14717570
14728639
14854532
14851982
15710381
14717056
15630473
14856352
14728338
14727824
15708310
14726048
15638415
14846119
15644347
15635900
14780081
14789005
14783137
14714008
14784922
14782387
14791341
15709101
14792358
14924682
15697049
14845624
14718617
15705221
14859690
14785721
15700397
14846646
14854543
14788273
14858169
15632000
14854803
14728615
14728611
14860166
15699889
15698324
15709106
15700893
15639963
14787724
14844304
14850188
14924424
14727355
14849186
15637429
15646113
14924702
14728626
15710362
14720152
14726544
14720425
14780053
14925237
15710615
14791073
14714551
15632041
14854847
14794640
14854335
14720651
14925733
14781350
14715276
14924723
14781070
14783126
15696283
14854585
14779045
14845845
14792375
14787259
14848411
15044509
14854528
14847629
14845881
14716801
14786225
15645827
15642300
15698608
14784445
14792639
14850717
14792079
14720181
14717879
14720931
15709100
14785971
15706301
14792102
14726559
15696822
14925240
14846113
14858370
14844343
14782624
14925702
15645059
14791558
14783897
15699895
14781861
15046309
15635388
14791811
14793644
14849716
14858369
14848950
14780846
15705744
14782882
14794424
14784659
14782638
14721164
59
14853036
14924707
14782129
14854328
15642043
15705764
14722487
15706559
14720143
14712964
15637689
14844331
14854054
14794425
15639951
14785452
14849943
15635072
14783132
14849723
14788001
15697336
14849945
15703180
14849198
14784174
15699106
14721183
14849171
14844058
14791846
15642019
14791090
15697341
14782123
14727610
14847396
14780845
14715820
14718129
14925470
14791087
15646616
14854293
15699894
15645855
15702461
15632275
15635351
15635874
14719141
14728342
14787974
14923958
14788746
14793885
14786432
14715047
14848936
14850980
14728090
14791337
15706256
15699850
14858662
14925199
14728634
15637376
15631019
15639223
14728616
15697291
15637889
14844545
14924210
14793385
14924680
15634613
71
124
14728629
14713266
14791821
15703430
14976906
14858141
14722223
14852481
14784667
15698358
14791610
14976907
122
14786746
15637679
14780084
14788757
14786433
14728346
14788738
14853019
14789541
58
14790791
14791580
14778517
14785153
14721414
15635361
15697844
14924712
15696573
14848931
14859412
14720156
14925448
15700922
15637166
14925449
14712978
15644059
14717855
14853534
15697294
14854275
14787242
14925202
14854567
15645368
15709090
14792355
14780595
15044748
14782116
14721198
14847135
14726563
15635854
15705738
14850701
14717872
14857646
15637169
15635340
14847933
14782870
14844039
15697073
14849199
15696776
14848919
14781624
15634605
14716594
14924938
14792608
14844095
15697799
14713507
14784694
15697317
15635894
14857663
14846655
15632269
15698865
14857868
14847621
14719148
14783147
15697315
14794647
14847901
14925461
14794399
15697030
15699883
15645607
14853782
15040917
14719911
14791316
14788482
14859176
15706255
15638451
32
14781595
14785420
14925460
14785161
14844606
15632010
14717365
14854829
14719654
14782875
14781585
15711887
14849205
14925492
14785207
14726289
14859169
15646344
15635366
14792604
14847125
14791867
14713235
15700355
14852744
14714016
14715785
15631039
14848432
14727854
15702917
15698101
14791359
15710338
14857890
14847633
14856367
15709825
14789565
14723498
15637920
14853054
14781604
15697284
14858647
14784129
15710117
15699890
14853254
14728619
14850721
14785936
91
14844550
14925726
50320
14781079
14847638
15641235
14849425
15044737
14846855
14850696
15638159
14845355
14716048
14924455
14784427
14790825
14794650
15635881
14858940
15710113
14858399
15710103
15699641
15635333
14847405
14847635
14788229
15703429
89
14924685
14844309
14788270
15045045
14785434
14849971
14924444
14727040
14794662
14728071
15710093
15708806
14715292
14854572
14847662
14778501
14781616
15708839
14784191
14780814
15637386
14779819
15046308
15639952
15045030
14791045
14847104
14924733
14722441
15636658
15708851
14725031
15638194
15699864
14785459
14788742
14925494
14860186
14859672
15632050
14726060
14719672
14785925
15705783
14854834
14792584
14787970
14859964
14924193
14848678
15645833
14791858
14723238
14781852
14789557
14853300
14785937
14846095
15631494
15696531
14845314
14846365
14721185
15638189
14717631
15646628
14793605
15701670
14924462
15709096
14793386
14782640
14925754
15637918
14714249
15699584
15710384
14720384
14716055
14791597
15639953
15708299
14714545
14925758
14783649
14786188
15708837
14714254
15696568
14720151
14924935
14781088
15698348
14724248
15642006
15703431
15645588
15635647
14859651
14790785
15706303
14792068
15699861
15637635
15642000
14859909
14715324
14727351
15699088
14720185
15646140
14857382
14857642
14924694
15638427
14718899
14728115
14859149
14924947
14924696
14715821
15636640
15697033
14718107
14781874
14924981
15646648
14925455
14782629
14728637
14854558
15698059
14785179
15045044
14725052
14849952
14924735
14791860
14858426
14786223
15701935
14849197
14845617
14779026
15639942
15631024
15638151
15697319
15635357
14722690
14780586
14791298
14717074
14727837
14858935
14924207
15705484
14849948
14789280
14783618
14782598
14788271
14791822
14718116
15703168
14780295
15645577
14794149
14844043
14852225
14854298
14854830
15699134
15632315
14856357
15646630
14852750
14783115
14718340
14848673
14860218
14728065
14789543
15636876
14791078
15698054
14784392
14846904
14851213
14782388
15706290
14850180
14854819
14854066
14844566
15709579
14718128
14851975
14717362
14844337
15638407
15698592
14858168
14852785
14858407
14792613
14791080
14853010
14716576
14787458
15696781
14853283
15701891
14860178
14844072
14792886
14787229
14859170
14719403
14779542
15697306
14717827
15638193
14794116
14783141
14716857
14727315
15631780
14794157
15634623
14794161
14846124
15703689
15708819
14782089
14781615
15698088
14726569
15697031
15708808
15699349
14785199
14718610
14718113
14779017
14793881
14713229
15635610
15696303
14727831
14724483
15710607
14722454
15710116
14854544
14714281
15708844
14716849
15638155
15702705
14718871
15642295
14925451
15703742
15644095
14713783
14860161
14783367
14855859
14782080
15696769
14844070
14779800
14852495
14783394
14713999
15698102
15706294
14784648
14714024
14848896
14844348
15637632
14781589
14859967
14847161
15635362
14785166
14858147
15696535
14852247
15705279
15697810
15710606
15697028
14859962
56
14846643
14858143
14782122
15045002
14779809
14717613
15698329
14847894
14846383
14779566
15700659
14859140
14786716
14844328
14848695
14782894
14784141
14781625
15705747
14727853
14784691
14784128
15639210
14852019
15632313
15639222
15710647
14724514
14728372
14781626
14789248
14850476
15697337
14721690
14715803
15638423
15042463
14792623
14716295
14783157
15701123
14779023
15632260
14724506
14714303
15701668
15644085
14784941
15042462
14781620
14719420
14727565
15706265
14859167
14856366
14791866
15705278
14858400
14859405
14849933
14724484
14714507
14859963
15696567
14780306
14846367
14852758
14856091
14856068
15710880
15639227
14791842
14783907
15697087
14717100
14714042
15646338
15636140
14785462
14720401
14784643
15699354
14793354
14788500
14850710
15710351
14858942
15700907
14788246
15637639
14852510
14789009
14785206
14854292
14715278
14786437
14788525
14716073
14786196
14788497
14721465
14854530
14925222
14720684
15048578
14716845
15638419
14850453
14717853
14788247
15702939
14846607
14852773
14782121
14844067
14721410
15637439
14719412
14722961
14787498
14779279
14852751
14790302
14715832
14782653
15709869
15698819
14714538
14852480
15645628
14860183
15632319
14846629
50614
14719132
14847903
14792109
14924934
14792075
51643
14716328
14924452
15645832
14924958
14784933
14781081
15634600
14726302
15639224
14859160
14846110
15698048
15252376
15639938
15699371
14852755
15637650
14781347
14852775
14859168
14844547
14781868
15048577
14924730
14854546
14779829
14792617
14857606
14792338
14844571
14853289
14715827
14787741
15640252
14722464
14719363
15706555
14727605
15710609
14853310
14794643
14791297
14788000
14849453
14788228
15698318
14793868
14844602
15635886
15642296
14728624
15701429
14859673
14724286
14850714
14846863
15701892
14787726
14844054
15710620
15710092
14849213
15041190
15696773
14788492
14720144
15646104
14716074
15701899
15635860
14923944
15045031
15044736
14846339
15635620
15699355
14723733
14791342
14858939
14924175
14844094
14844303
14786712
15698598
14721681
14722732
14849687
14925226
15635626
14721698
14725050
14854814
14787465
14855837
15637937
14852514
14859152
15697338
15710100
15046307
14848444
14722949
14850733
14846613
14859156
15696574
14848675
14714552
15710616
15703738
14781883
15699386
15705489
14780055
14719153
15708835
14789540
14924439
14714282
15635588
15698818
14782634
14924983
14720129
14719644
14924950
14925459
14923920
14781863
15698584
14714015
14791296
14713483
14784680
14728103
15698863
15709091
14849944
14728091
15699851
15646391
15705234
14784925
15699094
14794378
14790796
14844295
14859406
14858645
14852244
15697537
15646101
14723990
14847413
14783621
14715033
14850723
14793091
15697025
14847404
14850215
15044745
14853053
15697079
15710380
14723724
14785697
14723972
14844087
14723996
14787984
15641218
15703442
15631497
15710894
14845106
14858378
15712174
14788243
15697326
14724787
15631237
14853771
15698821
15703435
14715023
15637638
14849426
15646650
14791066
15703737
15635079
14784147
14728370
15709853
14924697
14794372
14781370
14846889
14780333
15699370
15646392
14788015
14781853
14925727
57227
50615
14714283
14845088
14857878
15637692
15636874
14793097
14844046
14793115
14848130
14781827
15641740
14790582
14858175
14779063
14849174
14718619
15646371
15635330
14847650
14849977
14846624
15642018
14785694
14714774
14717851
15632042
14783913
14712992
14850195
14857088
14846887
14781356
14854573
14924946
14721466
14857871
15044258
14779533
14722486
15631025
15635868
14716091
14792069
14786193
14780602
15697062
14852542
14848389
14715794
14790822
14781867
14782357
14847118
14719415
15703459
14791309
14724502
14713246
14714019
14857652
15646634
14860191
14784692
14728356
15701381
15697297
15700156
14858379
14780861
14720147
15698313
14786197
15252358
14925231
14722224
14782385
14854319
14847934
14717595
14925217
14925497
14781878
14720438
14858670
14856368
14791347
14717576
14849471
15635876
15698357
15636641
15641531
15696530
14857097
15631530
15637640
15634618
15710617
15711669
14719886
15635339
14724241
14785160
15696282
15645625
14850460
14716301
15708829
14858125
14718876
14854333
14724784
14853297
14724752
14860162
14781886
14849665
14858398
14792092
15631016
14848434
14714032
14787477
15634622
15700131
14844563
14793862
15699380
14723005
14719167
15710107
14713990
14
15641992
14783915
15708850
15709830
15700392
14778511
14857629
14779552
15699639
14854540
15636657
15637390
15044512
15040918
14780087
15700902
15632284
14855853
51637
14727096
14780044
15710890
15699358
15701682
15642292
14793639
14714559
15635870
14728127
14853791
14925208
14727302
15639975
15635892
14848391
14790310
14787988
14780297
15641748
14785458
14726290
14781064
15635368
15042485
15041412
14854579
14721725
14859677
15698561
14854071
14779575
14854802
14786227
14855307
15641221
14788741
14720385
14791051
14780326
14782871
14716037
14784940
14715267
14859164
15042465
15703958
14853055
15635078
14724798
14848410
14715015
14924438
38
14786200
15704707
15632036
15630720
14859440
14784190
14784409
15635363
15042492
15639947
14846619
15045041
15702919
15696572
14790303
14784932
14728630
14849712
15699082
14856377
14792087
15639217
15705776
15709117
14787762
14792108
14727826
14780848
14846373
15702928
14849416
14794173
15701388
14846606
15698848
51638
15701686
14788538
14793890
14784386
14781579
14788230
14791042
15632051
14793902
14781094
15646378
14794396
14858922
15696036
14853032
15044259
14846642
15631766
15644067
14716581
14847386
14793601
14786474
15708289
15642282
14785169
15638406
15646100
15631026
14848148
15710605
14924471
14924196
14714781
14712994
14714017
14721166
14855605
14714046
15704194
14791573
14847116
14786445
15698581
15631538
15709886
14925192
35
15699112
14847913
15701923
15634823
14792600
14728383
15708836
14794659
15646625
15638959
14782635
15700665
15705514
15639213
15709102
14728581
14845862
14781591
14782351
14782086
14721727
14785427
14924199
15710086
15701134
15697548
14714012
51644
14925759
15635872
14846099
14793344
15702206
14792327
15639971
14848703
14849460
14848186
15712165
15708811
14728329
15644079
14923946
15637401
14925444
15710628
14713758
14786945
14849152
14794126
15642013
14853506
14846874
15700884
14854813
14721926
15705771
15630734
15697281
14715018
14721706
14925218
14713746
14785191
15702950
14720953
15645852
14851235
14792070
15638454
14714261
15696042
15701897
14794666
14714267
15706554
14786947
15697581
14792343
15644042
15699361
14794634
14925724
14854821
14779823
15708595
14780067
14924200
14718131
14794658
15046306
14715804
14844821
14721470
15635637
14727072
14781357
15635639
14786180
14716086
14850728
14784669
14714284
15631798
14723738
14849936
14924928
14721215
14721153
14848149
15631794
15635343
15705765
14791871
14783893
14716858
15700924
15706002
14850713
14722178
14716035
14857912
15635589
15639221
15637433
14781600
14792365
14858428
14790326
15701660
14792616
14726842
14854808
14779795
14790275
14846878
15641987
14845616
15639941
14717371
14857896
14780079
14781092
14717107
14794114
15702656
14792336
14849437
14856322
14716582
15699867
14854810
14792098
14722978
15635586
14849938
14791819
15635887
15635625
15645843
14714014
15645080
14923917
15708809
15696308
14727335
14794139
14779815
14860204
14780309
14846354
14779278
15697053
14794660
15711622
14781351
14853550
14847108
15697280
15642299
14849980
15642291
14719649
14848384
14715317
14785726
15696264
14715822
14715054
14718647
14723475
14720940
14784679
15700352
15709111
14859139
14845365
14722199
15631501
14723203
14716597
15698579
15646626
14850698
14849194
14787751
15702707
14849967
15638422
15701163
14853524
15632005
15639202
14781057
14727581
15701914
15710122
14720404
15639946
14849982
14788010
14859678
14728341
15630491
14793637
14783890
15703198
14720929
14728625
14718897
15697041
14784914
14715819
15696263
14784662
14792369
14726029
15635861
14715308
14849466
14791318
14857619
15639959
14728083
14793375
14781605
14848175
14725801
14724504
15635879
14852798
15705772
14844322
14786962
15705009
14850435
14720136
15701920
14790541
14716577
14846627
14852754
15043998
14778809
15697841
14846121
14852284
15710903
14715802
14790819
14856067
14859671
15042487
14785177
14715529
14719639
14858654
14784936
14849680
14976896
15641990
15646339
14724027
14718641
14724285
14788261
15040916
14717619
15635899
14718881
15698866
14725002
14728378
15641985
14728066
14852246
14715030
15631764
14787766
14846122
14852745
15696060
15701646
15637403
15699096
15637137
15631286
14722448
14854591
14788018
14854578
14784959
14713757
14716605
14722955
15041189
14858913
14924944
14851983
14781622
15632028
14727350
14716850
14792348
15635596
14792096
14786450
14849451
14790787
14858906
14724266
15040927
14857105
15709868
14789048
15637172
14850218
15710108
14722714
15638417
15635114
14721187
15712154
14786481
14715281
15697292
15636895
15631030
14849718
14857617
14719935
15703196
15707531
14792853
14791064
15697823
15639936
14846347
14854061
14847919
14713988
14853817
14790784
14786482
14851755
15699072
14791611
14923935
14718383
15641224
14782860
14713219
14787743
15711677
15635897
14787248
14846886
14717352
14857404
15631032
14718616
15700114
15712141
14724260
15631526
14719622
14855329
14856098
15630748
14786194
14786995
15635866
14844581
14726582
15710089
15702943
14790059
14716331
14792621
14924203
15700380
14849926
14789043
14858915
15711925
15710904
15710646
15702670
14719638
15645068
14783152
14852493
14856103
15643787
14726590
15635120
14727298
15697311
15710339
14786440
15711656
14724497
14787730
14857918
14852490
14727327
14924952
14726562
15639229
15700407
14782876
14790846
15631021
14846648
14782132
14794675
14976905
14794637
15707540
14791853
14858422
14848398
15698061
15710897
15638191
14722219
15631532
14849671
14849211
14728109
14717353
15635089
14850468
15635329
14781608
14854811
14852521
15631781
14712969
15697325
15635585
14779299
14714280
15635865
14786211
14857386
14848681
15635082
14846086
14793652
14782883
14721469
14722456
14719145
14791075
15699636
14718343
14780091
14728620
14715286
15631539
14717587
14722954
14792066
15045007
15046305
14852253
15631784
15631551
14792127
15639710
14846893
15710645
15636651
14787722
14855302
14925728
51335
14787511
14719919
15639711
14791828
15638182
14727608
14718361
14786486
14722951
14854310
14786233
15638445
15635085
14848643
15711914
14727563
14721194
14925215
14718907
14781610
14790552
14847620
14726274
14782365
14717101
15708568
14856863
14858642
51332
14788776
14860187
14723248
14859409
14723760
15631010
14784390
14785716
15705270
15697068
15637377
15708849
14854051
15709097
15639218
14727103
14722189
14850465
14780093
14779544
14856364
14849448
15703703
14717885
14717077
15699120
14976904
14727811
14783381
15630732
14780305
15631017
14860208
14859907
14790272
14855856
15696821
15699091
15635094
15635088
14790836
14845116
14787239
14720927
14713481
15700354
14793657
14925236
15696788
14786963
15705235
15698860
15701403
14713989
14781373
14857894
14850956
14855809
14718368
14720187
15637393
14726586
15634610
14854277
14790334
14792100
14726790
15696566
14786479
15696059
15710104
15631805
15705005
15711905
14722709
15632047
15708601
15642039
14717887
14713259
14781609
14723735
14724015
15708813
15643786
14790827
14717350
14719402
14722188
14782364
14783129
14713997
14789249
14718898
15701678
14728105
14789040
14846884
15698830
14781098
15698366
14721415
14791606
14718850
14786491
14721411
14716863
14792345
14719918
14717087
14726296
14722747
15646340
15630988
14721678
14719162
15638946
15708820
15711931
15697056
14857107
14726546
14718900
14781341
14721704
15704217
14720168
14719921
14785691
15635092
14845857
14794392
15635381
14845085
14923950
14857130
14782646
15701676
15710610
14849193
15699391
14792377
14791085
14791068
14925221
14715021
14719660
14854297
14844306
15641734
15043752
15705251
14780077
15712153
15632272
14780327
14793403
14784683
14845870
14852022
15709113
14721670
14789293
14855580
14851254
14782101
15711875
15697058
14793856
14782108
15697085
15699615
14728094
14713255
14859148
15044495
15703437
14785923
15702183
14857870
14713499
14791555
15703209
14717092
14784661
14850990
15700123
14723998
14714028
15697331
14783423
15705246
14851997
14848653
14784696
14718893
15635867
15632293
15632282
15696284
15635591
50350
14792326
14779793
15635627
15710099
14784149
14854327
14792346
14779270
14784160
14721440
14850697
14780335
14844302
14852017
14850727
14852251
15635095
14792123
14856117
14857378
14845358
15696825
14728093
14791086
15630999
15698306
14791317
14793645
15642047
14859711
14727845
15699097
15632258
15699090
14780558
14720667
15702930
14791332
14721679
14848388
15630987
14848415
14728354
15642022
14715298
14852533
14857623
14716848
14715325
14783935
14793875
14846350
15701675
14724513
14786988
15708336
14715305
15635086
15646349
14715031
15703705
14717347
15635121
14726023
14848644
14925230
14724737
14792373
15640250
14785920
14858144
14720676
14719371
15698589
15635608
14780859
15701898
14727307
15637140
15643795
14723751
14720389
14856330
15697850
15703948
14788496
15635593
14718136
14714027
15637916
14794371
15637379
14848918
14723479
14722977
15631005
14849153
14852271
14785431
14792856
15706247
14724527
14723226
15710098
15630771
15707838
14788005
14717091
14858172
15635098
14849941
14781067
14790806
14849714
14849427
14786959
15709835
14714292
50335
14727320
14856064
14716062
15707815
14717870
15701432
14727334
14852240
14846140
15696004
14725040
14728336
14859648
14786462
14713748
15696785
15635878
14791076
14794653
15710109
14855056
14851739
15697541
15696525
14779547
14852028
15707545
14858163
14858155
15646629
14850748
15698068
15637685
15631749
14780839
15703953
15635612
15698879
14856115
15638144
15696558
14726045
15709370
15631520
14858925
15699362
14852024
15698604
14718882
15636866
14780808
14854845
15706795
15633833
15709115
14723500
14848699
14782139
14717081
14793103
14846866
15644344
14722461
14724507
14724280
15699888
15705478
14846614
14716095
14846632
15632266
14850740
51630
51617
14793126
15700912
15702941
14845621
14713485
15699376
51634
14853528
14718359
14784948
14856095
50594
14728631
14779293
14726312
15710602
15641989
15704728
15710382
15635873
14923949
15635623
14786209
14794646
14781348
14723499
14716351
14713263
14713474
15699100
14722463
14924164
51635
14716078
14716294
14848150
15709081
14848685
15698365
15697083
15697050
15698056
15631514
14846625
14849168
15045001
15702672
15638441
14728364
15631806
15637396
14780817
51647
14791072
15697034
14792118
14857654
14792622
15044514
15704994
14924170
15704983
14923965
14720440
14780580
14786201
14790578
15635364
14793889
15706245
14844084
15630478
15638430
15646649
14725557
15636906
14925721
14846108
15708316
14781598
14849701
14725051
14781337
14726552
15635849
15698087
14923926
14845853
14716568
15709099
14718885
14780074
14791865
15635618
14794144
15637158
14718360
15635851
15635605
15706296
14719920
14851992
14850948
15708550
15637642
14788226
14783121
14778508
14846138
14848442
14716350
14714555
15705268
15635350
15697802
15705499
14790585
15697852
14791824
14788756
14718620
15702667
15703469
14852505
15702972
15702932
15637919
14792605
14855068
15698305
15041188
15698878
14853266
15699592
14853270
14783386
14923927
14923940
14925718
14720396
14720132
14859428
14844845
15638207
14846599
14857116
14786184
14850474
15638156
14790801
14718363
14849937
15703175
14718621
14727607
14788275
14713513
14783130
15635077
14791096
14859966
15696287
14714780
14722494
14779019
14716554
15698843
14793646
15639700
14727870
14717581
14784404
14924931
14782859
14789030
14857100
15699625
14857895
14786992
15706001
15630781
14723502
14792631
14779308
15641222
14717338
14714031
15637643
14723007
15642302
14725017
14923929
14849684
14857389
14781838
14727846
14856878
14848145
14728099
14848438
14924459
15706540
15698822
14724490
14781359
15635601
14783404
14859182
14779779
14844088
14720920
15642007
14788487
15702946
15710373
15710090
14785450
14723001
15706046
14848654
14723762
14716860
14791574
51636
14793405
14976681
15706541
14722485
15631031
14847397
15639471
15700142
14854274
14716071
51331
14725021
14849166
14849676
14722237
14781568
14782603
14852497
14844812
15643801
14718120
15703464
15703444
15701633
14857093
14851229
15711659
14977446
14853040
14924475
14851749
14852540
15638918
15637672
14855826
14728349
14793874
14854556
15698065
15709116
14782886
15696007
15639701
14720926
15630730
15630743
15634612
15635377
14784921
15698335
15632008
14722443
14858174
15703192
14787205
14849185
15710082
15044239
14715061
14846142
14719405
15696314
14723003
15641984
14785466
15696527
15631022
15702402
15703699
14857622
14713525
14781340
14782655
15631012
15698094
14779564
14850986
15635890
14856372
15637384
14859448
14857391
14790023
15635895
14845348
14844585
14852484
14721209
14848446
14714521
14724758
14727576
14845869
14722438
14851766
14779786
14850473
15641761
14850470
15642280
14781577
14793620
15638409
14854038
14783920
14782345
14787512
15708827
14848168
14858896
14719912
14858923
14724273
15696808
14727839
15705507
14791315
15698825
14782872
14792873
15710370
14718649
14778764
15634608
15700621
14781845
14844561
14792846
14848646
14848697
14859697
14791849
14728633
14719381
14846650
15706242
14849429
14714504
14846084
14725537
14793654
15705247
14714270
14723201
14714259
15708348
15635595
15631528
15700122
15705748
14715316
15710622
15645580
14852501
15700880
14791602
14715053
14779787
14792607
15044262
14779520
15646635
15636886
15637179
15700886
14854306
15696001
14858655
14858637
14727342
14855342
15630749
14790586
15637135
15699343
15704465
15640508
14722205
15639961
15709109
14847876
15635856
14925457
15708074
15708047
14782349
15699390
14852258
14792083
15696791
14780315
15701662
14846594
14727558
14849452
15708838
14713766
15635599
14788537
14785946
15706548
15706293
15699092
14924201
14850693
14845319
14844838
15631772
14857092
14713530
14792593
14924695
14844044
14848397
15706244
14716862
14714257
14791827
14722460
15708823
14727598
15638438
15698585
50606
15641986
14720133
15701661
15638914
51329
15644034
14715571
14856378
14857644
15709112
15708333
15697309
14854020
14851979
14849699
14788026
15709110
15642288
15704452
14976922
15701144
15637947
14791079
15646377
15705784
14791856
14848935
15634606
15702927
15703460
14785719
15642009
14792105
14789262
14851771
14849159
14788752
15635632
14782907
15702916
15635896
15632292
15635344
15696571
15696513
14859915
14782609
14782601
14851772
14789307
15702424
14717370
14728111
15702156
15702151
15040912
14792121
15705475
14778552
14791869
15700622
14857089
14857365
14720137
14714271
14788257
14857862
15642032
15641730
14779567
14925743
14725277
14847134
15641492
14794163
15700116
14780807
15708594
15705482
14719406
14857374
15636900
14849415
15699884
14791593
15644056
14717583
14856066
14855604
14852520
14856075
14792106
15635352
15639950
14717868
15644094
14780050
14793381
15637646
14782094
14714253
15642033
14715838
14781573
14723507
14788263
14847160
14793377
15696057
15703451
15042469
14788774
14925740
15641788
14793369
15702201
14727305
15044531
15639944
14782099
15635383
15699903
15632529
14848416
15708815
14721188
15045003
15698619
14714258
14925244
15700925
14791325
14728368
15635127
14721156
15702686
15702695
15639688
14856088
14727309
14717069
14717070
14782347
15703177
15710369
15699598
14848171
14782120
14852774
14721703
14845586
15706022
14857146
14858126
14856100
15701919
14728322
14717861
15698331
14852267
51631
14849173
14791844
15643779
14844081
14847622
14849161
15710636
14848392
14849979
15702968
15702933
14722711
15046318
14859437
15638172
14785204
14849462
14844347
15631508
14792067
15710608
14728082
15631257
14717342
14720942
14722992
14792084
14845372
15638931
14791833
15712147
14784665
15711885
15639949
15635104
15637171
15701942
15646143
14715013
15701153
15710604
14857865
15632306
14717071
15704729
14784671
14848674
14723466
14782379
14721692
15044263
51334
14794146
14713744
14781321
14787004
14854295
15699375
14924686
14925711
14786439
14719678
14727577
14789278
14720414
15645850
15636628
14721449
14778510
14924953
14846362
14923913
14719933
14780036
14780321
50601
15699340
14793618
14792367
15636650
14726573
15703740
15697334
15700110
14721687
14717118
14848948
14719653
14787756
14713505
15703225
14852799
14793098
14787262
15700923
14785426
15631262
14716856
15710600
14792371
14848953
14785982
14787225
14791613
15702665
15710901
14792596
14781599
14857648
14782360
15046304
15046319
15698106
15645834
15040672
14855822
15704989
14715016
14856110
15637890
14721671
14790786
15640490
14723207
15709847
14850975
14718598
15710907
14786195
14722973
14854562
14713224
14924929
14849409
14847674
14788238
14786711
15703473
15706289
15044505
14786972
14721712
15041191
14791868
15710399
14848684
14786464
14728078
14793893
14787748
15708804
15702165
14851476
14781065
14728345
14788794
14790039
14791062
14857384
15045050
14724007
14715577
15697813
15705263
15641219
15699369
15703704
14715824
15696546
14853291
14718861
14788233
14787976
14723720
14846370
15705526
14781571
14722227
15703688
14847375
15046079
15041214
15646369
15646350
15697576
15698588
14787241
14856845
14846616
14719616
14723986
15697075
15703220
15698832
14924432
15631525
14721184
14720399
14720406
14781338
14855869
14728884
14783653
14790060
14855091
15704965
14728369
15703475
14780823
14923933
15696554
14717867
14786744
14722968
15698355
15699108
14849691
14854016
14924706
14844323
14848951
14724029
14712973
15706279
14722483
14855313
14716079
14780855
14859941